{
    "CompleterNpc": "Officer Reynolds",
    "NextQuestId": -1,
    "QuestLocation3": "",
    "RandomReward": 0b,
    "QuestLocation2": "",
    "QuestRepeat": 0,
    "QuestCompletion": 0,
    "Title": "Reporting the Capture",
    "Text": "After successfully apprehending the thief and recovering Ms. Beatrice Johnson's stolen bag, it's time to report back to Officer Reynolds at the Gramados Police Station. He’ll want to know that the situation has been resolved and the stolen property returned to its rightful owner.",
    "QuestFactionPoints": {
        "DecreaseFaction1Points": 0b,
        "OptionFaction2Points": 100,
        "OptionFactions1": -1,
        "OptionFactions2": -1,
        "OptionFaction1Points": 100,
        "DecreaseFaction2Points": 0b
    },
    "RewardExp": 0,
    "QuestCommand": "",
    "ModRev": 18,
    "Type": 3,
    "QuestMail": {
        "Sender": "Officer Reynolds",
        "MailQuestTitle": "Meeting Mr. Anderson",
        "BeenRead": 0b,
        "Message": {
            "pages": [
                "We've received a report regarding a stolen collection car. The vehicle's owner, Mr. Robert Anderson, is waiting for you at the Marina Vista Café & Grill. The café is located in the Marina Bay Building,",
                "a large and elegant structure along the Gramados Marina, just west of the Gramados University. Mr. Anderson is understandably upset, and he'll need your help to recover his prized vehicle.",
                "Please proceed to the Marina Vista Café & Grill to speak with Mr. Anderson and gather more information about the theft.",
                "Best of luck,
Officer Reynolds"
            ]
        },
        "MailItems": [
        ],
        "MailQuest": 57,
        "TimePast": 1728911008119L,
        "Time": 0L,
        "Subject": "Urgent: Report of a Stolen Collection Car"
    },
    "Rewards": {
        "NpcMiscInv": [
        ]
    },
    "CompleteText": "I’ve reported the successful capture of the thief and the recovery of the stolen bag to Officer Reynolds. He was pleased with the outcome. As I was leaving, I received a notification of a new mail—seems like there’s another task waiting for me. Time to check my mailbox and see what’s next.",
    "NextQuestTitle": "",
    "QuestLocation": "Gramados Police Station"
}
